agency-services-transunion/src/examples/brave/GetAuthenticationQuestions-Request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:con="https://consumerconnectws.tui.transunion.com/"
  xmlns:data="https://consumerconnectws.tui.transunion.com/data">
  <soapenv:Header/>
  <soapenv:Body>
    <con:GetAuthenticationQuestions>
      <con:request>
        <data:AccountCode>123456789</data:AccountCode>
        <data:AccountName>CC2BraveCredit</data:AccountName>
        <data:RequestKey>a05af7f3-5dc7-47fb-be5a-bc30ea5aa6df</data:RequestKey>
        <data:ClientKey>Customer123456</data:ClientKey>
        <data:Customer>
          <data:CurrentAddress>
            <data:AddressLine1>1000 JUNIPER</data:AddressLine1>
            <data:AddressLine2 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/>
            <data:City>Atlanta</data:City>
            <data:State>GA</data:State>
            <data:Zipcode>30326</data:Zipcode>
          </data:CurrentAddress>
          <data:DateOfBirth>1982-08-31</data:DateOfBirth>
          <data:FullName>
            <data:FirstName>JACKSON</data:FirstName>
            <data:LastName>TESTJ</data:LastName>
            <data:MiddleName xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/>
            <data:Prefix xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/>
            <data:Suffix xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/>
          </data:FullName>
          <data:PhoneNumber>4045049006</data:PhoneNumber>
          <data:Ssn>899010009</data:Ssn>
        </data:Customer>
        <data:Email xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/>
        <data:Language xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/>
        <data:ServiceBundleCode>CC2BraveCreditAuthentication</data:ServiceBundleCode>
        <data:TrustSessionId xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/>
      </con:request>
    </con:GetAuthenticationQuestions>
  </soapenv:Body>
</soapenv:Envelope>